/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dgalide <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/04/27 19:14:43 by dgalide           #+#    #+#             */
/*   Updated: 2016/04/27 19:15:11 by dgalide          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/ft_printf.h"
#include <limits.h>

int	main()
{
	ft_printf("%s %C %d %x %% %S\n\n", "bonjour ", L'該', 42, 42	, L"لحم خنزير");
	ft_printf("%s%d%%%S%D%i%o%O%u%U%x%X%c%C\n\n","bonjour", 42, L"暖炉", LONG_MAX, 42, 42, 42, 100000, ULONG_MAX, 42, 42, 'c', L'플');
}
